// 申报统计-来源地
const data1 = {
    series: [
        {
            name: '申报数',
            data: [100, 200, 300, 400, 500, 600, 700],
            unit: '人'
        },
        {
            name: '核查数',
            data: [100, 400, 500, 600, 200, 300, 700],
            type: 'line',
            unit: '人'
        },
        {
            name: '核查率',
            data: [10, 40, 50, 60, 20, 30, 70],
            type: 'line',
            unit: '%'
        }
    ],
    axis: ['中山', '广州', '深圳', '惠州', '广西', '潮汕', '云浮']
}

// 申报统计-目的地
const data2 = {
    series: [
        {
            name: '申报数',
            data: [100, 200, 300, 400, 500],
            unit: '人'
        },
        {
            name: '核查数',
            data: [100, 400, 500, 600, 200],
            unit: '人'
        },
        {
            name: '核查率',
            data: [10, 40, 50, 60, 20],
            type: 'line',
            unit: '%'
        }
    ],
    axis: ['后环社区', '前环社区', '唐家社区', '唐中社区', '唐乐社区']
}

// 行程卡打卡统计
const data3 = {
    series: [
        {
            name: '人数',
            data: [100, 200, 300, 400, 500, 600, 700],
            unit: '人'
        }
    ],
    axis: ['中山', '广州', '深圳', '惠州', '广西', '潮汕', '云浮']
}

// 异常打卡统计
const data4 = {
    series: [
        {
            name: '红码',
            data: [100, 200, 300, 400, 500, 600, 700],
            unit: '人'
        },
        {
            name: '黄码',
            data: [100, 200, 500, 600, 700, 300, 400],
            unit: '人'
        }
    ],
    axis: ['00:30', '01:00', '01:30', '02:00', '02:30', '03:00', '03:30']
}

// 场所异常打卡统计
const data5 = {
    series: [
        {
            name: '黄码',
            data: [100, 200, 300, 400, 500, 600, 700],
            unit: '人'
        },
        {
            name: '红码',
            data: [100, 400, 500, 600, 200, 300, 700],
            unit: '人'
        }
    ],
    axis: ['场所A', '场所B', '场所C', '场所D', '场所E', '场所F', '场所G']
}

// 核酸异常打卡
const data6 = {
    series: [
        {
            name: '红码',
            data: [100, 200, 300, 400, 500, 600, 700],
            unit: '人'
        }
    ],
    axis: ['00:30', '01:00', '01:30', '02:00', '02:30', '03:00', '03:30']
}

// 统计模块
const data7 = [
    {
        name: '风险区域申报总数',
        value: 256,
        unit: '人数'
    },
    {
        name: '风险场所',
        value: 4,
        unit: '个'
    },
    {
        name: '红码',
        value: 4,
        unit: '个'
    },
    {
        name: '黄码',
        value: 4,
        unit: '个'
    },
    {
        name: '异常核酸监测',
        value: 256,
        unit: '人数'
    }
]

module.exports = { data1, data2, data3, data4, data5, data6, data7 }
