// 统计模块
const data1 = [
    {
        name: '实际耕地面积',
        value: 1.06,
        unit: '亿亩'
    },
    {
        name: '实际耕地面积',
        value: 1.06,
        unit: '亿亩'
    }
]

// 当前使用状态统计
const data2 = {
    series: [
        {
            name: '种植面积',
            data: [3752.85, 1576.58, 1603.52, 620.2425, 102.9645, 184.452]
        }
    ],
    axis: ['棉花', '玉米', '小麦', '红枣', '苹果', '葡萄']
}

// 农机类型统计
const data3 = {
    series: [
        {
            name: '种植面积',
            data: [3752.85, 1576.58, 1603.52, 620.2425, 102.9645, 184.452]
        }
    ],
    axis: ['棉花', '玉米', '小麦', '红枣', '苹果', '葡萄']
}

// 年作业量农机统计
const data4 = {
    series: [
        {
            name: '种植面积',
            data: [3752.85, 1576.58, 1603.52, 620.2425, 102.9645, 184.452]
        }
    ],
    axis: ['棉花', '玉米', '小麦', '红枣', '苹果', '葡萄']
}

// 统计模块2
const data5 = [
    {
        name: '实际耕地面积',
        value: 1.06,
        unit: '亿亩'
    },
    {
        name: '实际耕地面积',
        value: 1.06,
        unit: '亿亩'
    }
]

// 新疆农机数量分布统计
const data6 = {
    series: [
        {
            name: '计划用水量',
            data: [17.08, 2.07, 6.41, 1.13, 3.98, 2.61]
        },
        {
            name: '实际用水量',
            data: [14.86, 2.21, 5.77, 1.03, 3.7, 2.49]
        }
    ],
    axis: ['棉花', '玉米', '小麦', '红枣', '苹果', '葡萄']
}

// 农机厂家占比分析
const data7 = [
    {
        name: '雷沃',
        value: 10
    },
    {
        name: '东方红',
        value: 10
    },
    {
        name: '久保田',
        value: 10
    }
]

// 总动力/配套总动力统计
const data8 = {
    series: [
        {
            name: '计划用水量',
            data: [17.08, 2.07, 6.41, 1.13, 3.98, 2.61]
        }
    ],
    axis: ['棉花', '玉米', '小麦', '红枣', '苹果', '葡萄']
}

module.exports = { data1, data2, data3, data4, data5, data6, data7, data8 }
